Revit 2026 API

# TemporaryViewModesCustomTitle Property

---

Custom title for the TemporaryViewProperties mode.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public string CustomTitle { get; set; }
```
```vb
Public Property CustomTitle As String
	Get
	Set
```
```cpp
public:
property String^ CustomTitle {
	String^ get ();
	void set (String^ value);
}
```
```fsharp
member CustomTitle : string with get, set
```

#### Property Value

String

| Exception | Condition |
| --- | --- |
| ArgumentNullException | When setting this property: A non-optional argument was null |

If custom title is not empty, Temporary View Properties mode displays it in the upper left corner of colored view frame.

#### Reference

TemporaryViewModes Class

Autodesk.Revit.DB Namespace